cask_args appdir: "~/Applications", require_sha: false

cask "iterm2"
cask "google-chrome"
cask "1password"
cask "slack"
cask "dbeaver-community"
cask "clickhouse"
brew "mas"

mas "Microsoft Excel", id: 462_058_435
mas "Microsoft Word", id: 462_054_704
mas "Microsoft PowerPoint", id: 462_062_816

brew "coreutils"
brew "moreutils"
brew "findutils"
brew "gnu-sed"
brew "bash"
brew "bash-completion2"
brew "python3"
brew "pipx"

brew "wget"

brew "gnupg"

tap "homebrew/cask-fonts"
tap "neovim/neovim"
brew "font-meslo-lg-nerd-font"

brew "vim"
brew "neovim"
brew "ripgrep"
brew "grep"
brew "openssh"
brew "tmux"
brew "php"
brew "gmp"

brew "kubectl"
brew "k9s"
brew "linode-cli"
brew "awscli"

tap "bramstein/webfonttools"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

brew "aircrack-ng"
brew "bfg"
brew "binutils"
brew "binwalk"
brew "cifer"
brew "dex2jar"
brew "dns2tcp"
brew "fcrackzip"
brew "foremost"
brew "hydra"
brew "john"
brew "knock"
brew "netpbm"
brew "nmap"
brew "pngcheck"
brew "socat"
brew "sqlmap"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "ucspi-tcp"
brew "xpdf"
brew "xz"

brew "ack"
brew "exiv2"
brew "git"
brew "git-lfs"
brew "gs"
brew "imagemagick"
brew "jq"
brew "lua"
brew "lynx"
brew "p7zip"
brew "pigz"
brew "pv"
brew "rename"
brew "rlwrap"
brew "ssh-copy-id"
brew "tree"
brew "vbindiff"
brew "zopfli"
